from .parser import Parser
from .render_h import RenderHtml 

def translate(source: str, theme: str, lang: str) -> tuple[str, str]:
    slides = Parser(source).parse()
    return RenderHtml(slides, theme, lang).render()

def get_title(source: str):
    slides = Parser(source).parse()
    if slides and len(slides):
        return slides[0].text
    else:
        return "notitle"

# тестування
if __name__ == "__main__":
    source = """
@1 02 Машинна мова
@@ машинн+ команд+

@2 Машинні команди

@6
Код, Адреса, Команда
01, NNNN, зчитати: скопіювати до суматора зміст комірки NNNN
02, NNNN, записати: зміст суматора скопіювати в комірку NNNN
11, NNNN, додати до суматора зміст комірки NNNN
12, NNNN, відняти від суматора зміст комірки NNNN
13, NNNN, помножити суматор на зміст комірки NNNN
20, NNNN, перейти до команди з адресом NNNN (занести в лічильник команд число NNNN)

@3 Програма є послідовністю машинних команд.

@5
oooo. 01 1010
ooo1. 03 1011
ooo2. 02 1010
ooo3. ...


@3 Один крок роботи процесора:
- виконати команду, адреса якої знаходиться в лічильнику команд
- якщо команда не є переходом, лічильник команд збільшити на 1 
[[https://tss.co.ua/ML/]]

@2 Програмування

@3 Задача 1. Скласти числа, що знаходяться в комірках 11 і 12. Суму зберегти в комірці 13
  
@3 Задача 2. Обміняти місцями зміст двох комірок.

@1 Команда присвоєння
@@ коментар
@@ коментар
@@ коментар

@3 Коли нам потрібно надати змінній нове значення,  
ми пишемо команду присвоєння  {{x = 5}}

@3 Загальний вигляд команди присвоєння:

@4 ім'я = вираз

@3 Виконується команда у два кроки:
   1) обчислюється вираз справа від знаку "=";
   2) результат обчислення надається змінній зліва від знаку "=".

@5
a = 2 + 3
a = a + 1

@2 Устрій комп'ютера

@3 [[basic_struct.png]]
Пам'ять - зберігає інформацію.
Процесор - виконує команди.
Пристрої введення і виведення - підтримують зв'язок із зовнішнім світом.

@3 
[[https://google.com | Оце так гугол!]]

"""
    body = translate(source, theme="github", lang="javascript")

    with open(f"111.html", "w") as f:
        f.write(body)

